# Preparing the development of a music recommender system

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Data Cleaning

##### users.csv

**Task**: Import the *users.csv* file

In [8]:
df_users = pd.read_csv("users.csv")
df_users.head()

                       uid;p;m1;m2;m3
0    33616;1;1136;;1250.6320492991067
1   32048;Yes;2011;;2294.355415100163
2  29095;Yes;1486;;1346.6327689420677
3     32106;No;131;;140.6399934371262
4     31885;Yes;929;;820.273300749299

**Task**: Rename the columns according to the description in the exercise sheet into a more readible format.

In [9]:
df_users = pd.read_csv("users.csv", delimiter=";")
df_users.columns = ["uuid", "p", "m1", "m2", "m3"]
df_users.head(10)

    uuid    p    m1      m2           m3
0  33616    1  1136     NaN  1250.632049
1  32048  Yes  2011     NaN  2294.355415
2  29095  Yes  1486     NaN  1346.632769
3  32106   No   131     NaN   140.639993
4  31885  Yes   929     NaN   820.273301
5  33704    1   928     NaN   946.878506
6  27940  Yes  2168  2287.0  2256.762361
7  32566   No  1220     NaN  1168.001188
8  33727    0  1505     NaN  1519.308251
9  27803    1   633     NaN   686.691261

**Task**: Unify the labels for the *Premium* attribute.

In [12]:
premium_mapping = {"0": False, "No": False, "1": True, "Yes": True}
df_users["p"] = df_users["p"].replace(premium_mapping)
df_users.head(5)

/var/folders/_l/xbjs439j31l5zpbzq9pbf3p80000gn/T/ipykernel_1112/1172381580.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_users["p"] = df_users["p"].replace(premium_mapping)

    uuid      p    m1  m2           m3
0  33616   True  1136 NaN  1250.632049
1  32048   True  2011 NaN  2294.355415
2  29095   True  1486 NaN  1346.632769
3  32106  False   131 NaN   140.639993
4  31885   True   929 NaN   820.273301

**Task**: Impute the missing values of the attribute *Minutes2* using the values of *Minutes1* and *Minutes3*.

In [13]:
df_users["m2"] = df_users.apply(
    lambda row: (row["m1"] + row["m3"]) / 2 if pd.isna(row["m2"]) else row["m2"],
    axis = 1
)
df_users.head()

    uuid      p    m1           m2           m3
0  33616   True  1136  1193.316025  1250.632049
1  32048   True  2011  2152.677708  2294.355415
2  29095   True  1486  1416.316384  1346.632769
3  32106  False   131   135.819997   140.639993
4  31885   True   929   874.636650   820.273301

##### user_behavior.csv

**Task**: Read the *user_behavior.csv* file.

In [21]:
df_behavior = pd.read_csv("user_behavior.csv")
df_behavior.head()

       user_id;song_id;num_clicks;ml;g;f;mod;artists
0  29158;55060;64;251.98245996954293;Rock;1;2023-...
1  33692;5080;63;260.00105640445656;Pop;0;2023-08...
2  31198;25839;24;105.3550203608923;Hip-Hop;1;202...
3  33302;87341;36;142.08526712340915;Electronic;0...
4  34592;47110;74;301.3149939582877;Pop;0;2023-04...

**Task**: Rename the columns according to the description in the exercise sheet.

In [24]:
df_behavior = pd.read_csv("user_behavior.csv", delimiter=";")
df_behavior.columns = ["user_id", "song_id", "artists", "num_clicks", "ml", "g", "f", "mod"]
df_behavior.head(3)

   user_id  song_id  artists  num_clicks       ml  g           f   mod
0    29158    55060       64  251.982460     Rock  1  2023-09-22   662
1    33692     5080       63  260.001056      Pop  0  2023-08-14  4937
2    31198    25839       24  105.355020  Hip-Hop  1  2023-06-24  6289

**Task:** Fix the data types of the attributes *Genre* (categorical) and *Favorite* (binary, categorical).

In [31]:
df_behavior.columns = ["user_id", "song_id", "artists", "num_clicks", "g", "f", "mod", "ml"]
df_behavior.head(3)

   user_id  song_id  artists  num_clicks        g  f         mod    ml
0    29158    55060       64  251.982460     Rock  1  2023-09-22   662
1    33692     5080       63  260.001056      Pop  0  2023-08-14  4937
2    31198    25839       24  105.355020  Hip-Hop  1  2023-06-24  6289

**Task:** Some genres have more songs than others. Adjust the data set such that it includes only the four largest genres and the genre "Other" that summarizes all remaining genres.

In [38]:
genre_counts = df_behavior["g"].value_counts()
top_4_genres = genre_counts.head(4).index
df_behavior["g"] = df_behavior["g"].apply(lambda x: x if x in top_4_genres else "Other")
df_behavior["g"].value_counts()

g
Other         2055
Electronic    2036
Rock          1978
Hip-Hop       1977
Pop           1954
Name: count, dtype: int64

**Task:** Create for a new column for the weekday, year, month, and day of each date names *ModifiedAt*.

In [39]:
df_behavior["mod"] = pd.to_datetime(df_behavior["mod"])
df_behavior["Weekday"] = df_behavior["mod"].dt.day_name() 
df_behavior["Year"] = df_behavior["mod"].dt.year  
df_behavior["Month"] = df_behavior["mod"].dt.month  
df_behavior["Day"] = df_behavior["mod"].dt.day
df_behavior.head(3)

,user_id,song_id,artists,num_clicks,g,f,mod,ml,Weekday,Year,Month,Day
0,29158,55060,64,251.982460,Rock,1,2023-09-22,662,Friday,2023,9,22
1,33692,5080,63,260.001056,Pop,0,2023-08-14,4937,Monday,2023,8,14
2,31198,25839,24,105.355020,Hip-Hop,1,2023-06-24,6289,Saturday,2023,6,24

#### artists.csv

**Task**: Read the *artists.csv* file and re-name the columns according to the exercise sheet.

In [40]:
df_artists = pd.read_csv("artists.csv", delimiter=";")
df_artists.columns = ["artist_id", "genre", "featured", "monthly_listeners"]
df_artists.head(3)

   artist_id  genre  featured  monthly_listeners
0       8497  Error         0             529178
1       3331  Error         0            1319507
2       7097   Rock         0             739339

**Task:** Convert the attributes *Genre* and *Featured* to categorical variables.

In [42]:
df_artists["genre"] = df_artists["genre"].astype("category")
df_artists["featured"] = df_artists["featured"].astype("category")
df_artists.head(3)

   artist_id  genre featured  monthly_listeners
0       8497  Error        0             529178
1       3331  Error        0            1319507
2       7097   Rock        0             739339

### Data aggregation

**Task:** Merge the *users* and *user_behavior* tables together. Create a view in which you determine how many minutes a user listens to songs on average. Additionally, what is the highest number of clicks a user had on a song?

In [54]:
df_concat = pd.concat([df_users, df_behavior], axis=1)

In [61]:
df_concat["average_minutes_listened"] = (df_concat["m1"] + df_concat["m2"] + df_concat["m3"]) / 3
df_concat.groupby("user_id").agg(
    avg_listen_minutes = ('average_minutes_listened', 'mean'),
    max_num_clicks = ('num_clicks', 'max')
)

         avg_listen_minutes  max_num_clicks
user_id
27367           1833.167647      382.176699
27378           1776.779570      381.835013
27393            790.533680      392.148320
27395           1417.781399      382.673128
27397           1477.833546      393.398265
...                     ...             ...
37260                   NaN      402.223829
37273                   NaN      402.764502
37284           1345.172826      366.065651
37294                   NaN      406.034437
37330            498.931749      382.150060

[512 rows x 2 columns]

**Task:** Merge the *user_behavior* and *artist* tables to determine the most clicked artist per genre (defined by the song).

In [64]:
df_concat2 = pd.concat([df_behavior, df_artists], axis=1)
df_concat2.columns

Index(['user_id', 'song_id', 'artists', 'num_clicks', 'g', 'f', 'mod', 'ml',
       'Weekday', 'Year', 'Month', 'Day', 'artist_id', 'genre', 'featured',
       'monthly_listeners'],
      dtype='object')

Question: Why can't we just use artists.merge(user_behavior)?

Answer: 
- Because overlapping of features such as the genre.
- The artist can have a different (and also the same) genre than the user associated with the song.

Which is the most clicked artist per genre of the song?

In [66]:
grouped = df_concat2.groupby(["genre", "artists"])["num_clicks"].sum().reset_index()
most_clicked_artists = grouped.loc[grouped.groupby("genre")["num_clicks"].idxmax()]
most_clicked_artists

/var/folders/_l/xbjs439j31l5zpbzq9pbf3p80000gn/T/ipykernel_1112/1430524837.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped = df_concat2.groupby(["genre", "artists"])["num_clicks"].sum().reset_index()
/var/folders/_l/xbjs439j31l5zpbzq9pbf3p80000gn/T/ipykernel_1112/1430524837.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  most_clicked_artists = grouped.loc[grouped.groupby("genre")["num_clicks"].idxmax()]

       genre  artists   num_clicks
90   Classic       90  1802.659620
184    Error       84  3111.134376
279    Other       79   625.991995
388      Rap       88  1767.657102
481     Rock       81   960.831688
594   Techno       94  1154.114332

Answerk:

**Task**: Determine for each artist, the fan that spends the most minutes listening their music

In [69]:
artist_user_time = df_concat2.groupby(['artists', 'user_id'])['ml'].sum().reset_index()
top_fans = artist_user_time.loc[artist_user_time.groupby('artists')['ml'].idxmax()]
top_fans

      artists  user_id     ml
30          0    31422  25643
164         1    36778  16306
179         2    29149  16715
344         3    37065  22260
428         4    34533  16150
...       ...      ...    ...
8754       95    34117  13481
8785       96    28625  18813
8932       97    35648  14686
8948       98    28552  17103
9052       99    31026  15143

[100 rows x 3 columns]